Nombre:Sabrina Andrea Hernandez
Dia:16/11/2021
Maestro:Ingeniero Horacio
________________________________________________________________________________
1
clear

%Dominio de la función
x=[-20:1:20];

%plot
gx=x.^2

%Plot
plot(x, gx)
________________________________________________________________________________
2
clear 

% Dominio de la función
x=[0:1:40];

%plot
hx=x.^2

%plot
(x, hx)
________________________________________________________________________________
3
claro

% Dominio de la función
x=[-15:1:20];

%plot
fx= x.^3

%plot
gráfico (x, fx)
________________________________________________________________________________
4
claro

% Dominio de la función
x=[-32:1:45];
%plot
rx=(x.^3,3);
%plot
(x, rx)
________________________________________________________________________________
claro 

% Dominio r 
r=[-30:1:-1];

%plot
rx=1./(r.^3);

%plot
(r,rx)
________________________________________________________________________________
claro 

% Dominio de la función
x=[-20:1:20];

%plot
fx=((x.^4)(+1)./(x.^3));

%plot
(x, fx)